<?php

return [
    'user' => [
        'registration' => 'Пользователь успешно зарегистрирован.',
        'unauthorized' => 'Введены неверные данные.',
        'logout' => 'Успешно вышли из системы.'
    ],

    'counterparty' => [
        'created' => 'ИНН успешно добавлен для контрагента.',
        'not_found' => 'Не удалось получить данные по ИНН.',
        'success' => 'Данные успешно получены.',
        'da_data_error' => 'Ошибка DaData. Статус:',
        'da_data_exception' => 'Исключение при запросе DaData:',
        'inn_not_found' => 'Данные по ИНН не найдены.',
        'invalid_format' => 'Некорректный формат ответа от DaData.'
    ]
];
